eg2.vscode-npm-script
firefox-devtools.vscode-firefox-debug
fvclaus.sort-json-array
james-yu.latex-workshop
leonardssh.vscord
pflannery.vscode-versionlens
richie5um2.vscode-sort-json
rid9.datetime
shardulm94.trailing-spaces
timonwong.shellcheck
